iNavFlight/inav/lib/main/STM32H7/Drivers/BSP/Components/gt911/gt911_reg.h
/*******************************************************************************
  * Register      : CIPHER
  * Address       : 0XA3
  * Bit Group Name:
  * Permission    : R
  * Default value : 0x06
  *******************************************************************************/
#define   GT911_CIPHER_BIT_MASK           0xFFU
#define   GT911_CIPHER_BIT_POSITION       0U
int32_t gt911_cipher(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : M_SW1
  * Address       : 0x804D
  * Bit Group Name:
  * Permission    : RW
  * Default value : 0x00?
  *******************************************************************************/
#define   GT911_M_SW1_BIT_MASK            0x03U
#define   GT911_M_SW1_BIT_POSITION        0U
int32_t gt911_m_sw1(gt911_ctx_t *pCtx, uint8_t value);

/*******************************************************************************
  * Register      : PWR_MODE
  * Address       : 0XA5
  * Bit Group Name:
  * Permission    : RW
  * Default value : 0x00
  *******************************************************************************/
#define   GT911_PWR_MODE_BIT_MASK           0xFFU
#define   GT911_PWR_MODE_BIT_POSITION       0U
int32_t gt911_pwr_mode(gt911_ctx_t *pCtx, uint8_t value);

/*******************************************************************************
  * Register      : FIRMID
  * Address       : 0XA6
  * Bit Group Name:
  * Permission    : R
  * Default value : None
  *******************************************************************************/
#define   GT911_FIRMID_BIT_MASK           0xFFU
#define   GT911_FIRMID_BIT_POSITION       0U
int32_t gt911_firm_id(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : FOCALTECH_ID
  * Address       : 0XA8
  * Bit Group Name:
  * Permission    : R
  * Default value : 0x11
  *******************************************************************************/
#define   GT911_CHIP_ID_BIT_MASK           0xFFU
#define   GT911_CHIP_ID_BIT_POSITION       0U
int32_t gt911_chip_id(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : RELEASE_CODE_ID
  * Address       : 0XAF
  * Bit Group Name:
  * Permission    : R
  * Default value : 0x001
  *******************************************************************************/
#define   GT911_RC_ID_BIT_MASK           0xFFU
#define   GT911_RC_ID_BIT_POSITION       0U
int32_t gt911_release_code_id(gt911_ctx_t *pCtx, uint8_t *pValue);

/*******************************************************************************
  * Register      : STATE
  * Address       : 0XBC
  * Bit Group Name:
  * Permission    : RW
  * Default value : 0x01
  *******************************************************************************/
#define   GT911_STATE_BIT_MASK           0xFFU
#define   GT911_STATE_BIT_POSITION       0U
int32_t gt911_mode(gt911_ctx_t *pCtx, uint8_t value);

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif
#endif /* GT911_REG_H */
